In [1]:
# Initial imports
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

%matplotlib inline

In [2]:
df_whales = pd.read_csv("whale_returns.csv")

In [3]:
df_whales.dropna(inplace = True)
#df_whales.drop(columns=['Date'], inplace=True)
df_whales.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
5,2015-03-09,0.000582,0.004225,0.005843,-0.001652

In [4]:
algo_returns = pd.read_csv('algo_returns.csv')

In [5]:
algo_returns.isnull().sum()

Date      0
Algo 1    0
Algo 2    6
dtype: int64

In [6]:
#algo_returns.dropna(columns=['Date'], inplace=True)
algo_returns

            Date    Algo 1    Algo 2
0     2014-05-28  0.001745       NaN
1     2014-05-29  0.003978       NaN
2     2014-05-30  0.004464       NaN
3     2014-06-02  0.005692       NaN
4     2014-06-03  0.005292       NaN
...          ...       ...       ...
1236  2019-04-25  0.000682 -0.007247
1237  2019-04-26  0.002981  0.005256
1238  2019-04-29  0.005208  0.002829
1239  2019-04-30 -0.002944 -0.001570
1240  2019-05-01  0.000094 -0.007358

[1241 rows x 3 columns]

In [7]:
algo_returns.dropna( inplace= True )
algo_returns.isnull().sum()
algo_returns.head()

          Date    Algo 1    Algo 2
6   2014-06-05  0.004062  0.013285
7   2014-06-06  0.001857  0.008284
8   2014-06-09 -0.005012  0.005668
9   2014-06-10  0.004406 -0.000735
10  2014-06-11  0.004760 -0.003761

In [12]:
sp500 = pd.read_csv('sp500_history.csv')
sp500

           Date     Close
0     23-Apr-19  $2933.68
1     22-Apr-19  $2907.97
2     18-Apr-19  $2905.03
3     17-Apr-19  $2900.45
4     16-Apr-19  $2907.06
...         ...       ...
1644   5-Oct-12  $1460.93
1645   4-Oct-12  $1461.40
1646   3-Oct-12  $1450.99
1647   2-Oct-12  $1445.75
1648   1-Oct-12  $1444.49

[1649 rows x 2 columns]

In [13]:
sp500['Date'] = pd.to_datetime(sp500['Date'])
sp500.head()

        Date     Close
0 2019-04-23  $2933.68
1 2019-04-22  $2907.97
2 2019-04-18  $2905.03
3 2019-04-17  $2900.45
4 2019-04-16  $2907.06

In [14]:
sp500['Close'] = sp500['Close'].str.replace("$" , "", regex = True )

In [15]:
sp500['Close'] = sp500['Close'].astype(float)
sp500['Close']

0       2933.68
1       2907.97
2       2905.03
3       2900.45
4       2907.06
         ...
1644    1460.93
1645    1461.40
1646    1450.99
1647    1445.75
1648    1444.49
Name: Close, Length: 1649, dtype: float64

In [16]:
#sp500['Close'].pct_change(1)
sp500['Daily_returns'] = sp500['Close'].pct_change(1).dropna()
sp500['Daily_returns']

0            NaN
1      -0.008764
2      -0.001011
3      -0.001577
4       0.002279
          ...
1644    0.003469
1645    0.000322
1646   -0.007123
1647   -0.003611
1648   -0.000872
Name: Daily_returns, Length: 1649, dtype: float64

In [17]:
sp500['Daily_returns'].dropna()
#sp500['Daily_returns'].dropna(inplace = True)
#sp500 = sp500.set_index('Date')
sp500['Daily_returns']

0            NaN
1      -0.008764
2      -0.001011
3      -0.001577
4       0.002279
          ...
1644    0.003469
1645    0.000322
1646   -0.007123
1647   -0.003611
1648   -0.000872
Name: Daily_returns, Length: 1649, dtype: float64

In [18]:
#group_analysis= pd.concat([algo_returns, sp500 , df_whales , join = 'inner' , on = 'Date')
#group_analysis.set_index('Date')
#group_analysis.dropna(inplace = True)
#group_analysis
df_merged = df_whales.merge(algo_returns, on='Date',  how='inner')
df_merged['Date'] = pd.to_datetime(df_merged['Date'])
df_merged
df_merged1 = df_merged.merge(sp500, on='Date',  how='inner')
df_merged1.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Algo 1,Algo 2,Close,Daily_returns
0,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569,-0.001942,-0.000949,2107.78,0.004408
1,2015-03-04,0.002230,0.003241,-0.002534,0.004213,-0.008589,0.002416,2098.53,-0.001195
2,2015-03-05,0.004016,0.004076,0.002355,0.006726,-0.000955,0.004323,2101.04,0.014378
3,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098,-0.004957,-0.011460,2071.26,-0.003929
4,2015-03-09,0.000582,0.004225,0.005843,-0.001652,-0.005447,0.001303,2079.43,0.017254

In [ ]:
#group_analys = group_analysis.dropna(inplace = True)

In [ ]:
#group_analysis

In [ ]:
# Plot daily returns of all portfolios


#sp500['Close'].pct_change(1).plot()
#group_analysis['Daily_returns'].plot(ax=ax)
#group_analysis['Algos 1'].plot(ax=ax)
#group_analysis['Algos 2'].plot(ax=ax)

In [ ]:
#algo_returns['Algo 1'].plot()

#group_analysis['Algo 1'].plot()